app/views/posts/show.html.erb

<p> <%= @post.body %> </p>
<p> <% @post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = $1  [["post_id", 2]]