app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["body", "Test test"], ["created_at", "2017-09-20 21:24:23.756767"], ["updated_at", "2017-09-20 21:24:23.756767"]]
---
  def create
    @post = Post.create(post_params)